# 7. Написати функцію, яка приймає на вхід список (через кому),
# підраховує кількість однакових елементів у ньому і виводить результат.
# Елементами списку можуть бути дані будь-яких типів.
#     Наприклад:
#     1, 1, 'foo', [1, 2], True, 'foo', 1, [1, 2] ----> "1 -> 3, foo -> 2, [1, 2] -> 2, True -> 1"


def dublikate():
    new_list = list(map(str, list_1))
    df = dict()
    for x in new_list:
        if x not in df:
            df[x] = df.get(x, 0)
        df[x] += 1
    for key in df.keys():
        print('Вираз: "', key,'" повторюється', df[key], 'раз')


list_1 = [1, 1, 'foo', [1, 2], True, 'foo', 1, [1, 2]]
dublikate()
