# 2. Написати функцію <bank> , яка працює за наступною логікою:
# користувач робить вклад у розмірі <a> одиниць строком на <years> років
# під <percents> відсотків (кожен рік сума вкладу збільшується на цей відсоток,
# ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки).
# Параметр <percents> є необов'язковим і має значення по замовчуванню <10> (10%). ' \
# ''Функція повинна принтануть суму, яка буде на рахунку, а також її повернути
# (але округлену до копійок).


def bank():
    money = float(input('Введіть суму яку хочете покласти на депозит:\n'))
    years = int(input('На скільки років:\n'))
    percent = int(input('Під відсоток (від 1 до 10):\n'))
    if percent <= 10:
        return money + (money / 100 * percent * years)
    else:
        print('Не можна більше 10%!')
        return bank()


try:
    print('Ваш дохід становитиме:', round(bank(), 2),'грн')
except ValueError:
    print('Це не числа!')
