#3. Користувач вводить змінні "x" та "y" з довільними цифровими значеннями.
# Створіть просту умовну конструкцію (звiсно вона повинна бути в тiлi ф-цiї),
# під час виконання якої буде перевірятися рівність змінних "x" та "y"
# та у випадку нерівності - виводити ще і різницю.
# Повинні працювати такі умови (x, y, z заміність на відповідні числа):
# x > y;       вiдповiдь - "х бiльше нiж у на z"
# x < y;       вiдповiдь - "у бiльше нiж х на z"
# x == y.      відповідь - "х дорівнює y"


def difference(x, y):
    if x > y:
        print('Число ',x, 'більше за', y, 'на', x-y)
    elif x < y:
        print('Число ', y, 'більше за', x, 'на', y-x)
    else:
        print(x, 'дорівнює', y)

        
try:
    x = int(input('Введіть число х:\n'))
    y = int(input('Введіть число у:\n'))
    difference(x,y)
except ValueError:
    print('Це не ціле число!')
