# 5. Ну і традиційно - калькулятор :легкая_улыбка: Повинна бути 1 функцiя,
# яка приймає 3 аргументи - один з яких операцiя, яку зробити! Аргументи
# брати від юзера (можна по одному - окремо 2, окремо +, окремо 2;
# можна всі разом - типу 2 + 2).
# Операції що мають бути присутні: +, -, *, /, %, //, **.
# Не забудьте протестувати з різними значеннями на предмет помилок!


try:
    def calculateor():
        while True:
            print('Натишіть # для виходу!')
            mat = input('Виберіть математичну дію: +,-,*,/,//,%,**')
            if mat in ('+', '-','*', '/', '//', '%', '**'):
                x = float(input('Введіть х:\n'))
                y = float(input('Введіть у:\n'))
                if mat == '+':
                    print('Дорівнює:\n', x+y)
                elif mat == '-':
                    print('Дорівнює:\n', x-y)
                elif mat == '*':
                    print('Дорівнює:\n', x*y)
                elif mat == '/':
                    print('Дорівнює:\n', x/y)
                elif mat == '//':
                    print('Дорівнює:\n', x//y)
                elif mat == '%':
                    print('Дорівнює:\n', x%y)
                elif mat == '**':
                    print('Дорівнює:\n', x**y)
            elif mat == '#':
                break
            else:
                print('Це не математична дія!!!!!!!!!!!!!!!')


    calculateor()
except ValueError:
    print('Калькулятор букви та незрозумілі символи не рахує!')
except ZeroDivisionError:
    print('Сідай, 2! На нуль ділити не можна!')
