# 1. Написати функцiю season, яка приймає один аргумент
# (номер мiсяця вiд 1 до 12) та яка буде повертати пору року,
# до якої цей мiсяць належить (зима, весна, лiто або осiнь).
# У випадку некоректного введеного значення - виводити відповідне повідомлення.


def season(x):
    if 3 <= x <= 5:
        return 'весни'
    elif 6 <= x <= 8:
        return 'літа'
    elif 9 <= x <= 11:
        return 'осені'
    elif 1 <= x <= 12:
        return 'зими'
    else:
        print('В природі всього 12 місяців!')
        return season(int(input('Напиши від 1 до 12:\n')))


try:
    result = season(int(input('Напишіть номер місяця:\n')))
    print('Це місяць', result)
except ValueError:
    print('Це не число!')
